## Plan Result (demo - TerraformPlanApply)




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.demo-apps-private-dns.azurerm_private_dns_cname_record.this[&#34;darts&#34;]
  * module.demo-apps-private-dns.azurerm_private_dns_cname_record.this[&#34;juror&#34;]
  * module.demo-apps-private-dns.azurerm_private_dns_cname_record.this[&#34;juror-public&#34;]
  * module.demo-apps-private-dns.azurerm_private_dns_zone.zone[0]
  * module.demo-apps-private-dns.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.demo-apps-private-dns.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-aad-domain-services-mgmt-vnet&#34;]
  * module.demo-apps-private-dns.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;dynatrace-activegate-vnet-nonprod&#34;]
  * module.demo-apps-private-dns.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;private-dns-resolver-uksouth-vnet-nonprodi&#34;]
  * module.demo-apps-private-dns.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;vpn&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.demo-apps-private-dns.azurerm_private_dns_cname_record.this["darts"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts"
      + record              = "sdshmcts-demo-d9brfxgseqf0cpen.z01.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "demo.apps.hmcts.net"
    }

  # module.demo-apps-private-dns.azurerm_private_dns_cname_record.this["juror"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror"
      + record              = "sdshmcts-demo-d9brfxgseqf0cpen.z01.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "demo.apps.hmcts.net"
    }

  # module.demo-apps-private-dns.azurerm_private_dns_cname_record.this["juror-public"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror-public"
      + record              = "sdshmcts-demo-d9brfxgseqf0cpen.z01.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "demo.apps.hmcts.net"
    }

  # module.demo-apps-private-dns.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "demo.apps.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }

      + soa_record (known after apply)
    }

  # module.demo-apps-private-dns.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "demo.apps.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.demo-apps-private-dns.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-aad-domain-services-mgmt-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-aad-domain-services-mgmt-vnet"
      + private_dns_zone_name = "demo.apps.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/core-aad-domain-services-mgmt-rg/providers/Microsoft.Network/virtualNetworks/core-aad-domain-services-mgmt-vnet"
    }

  # module.demo-apps-private-dns.azurerm_private_dns_zone_virtual_network_link.vnet_link["dynatrace-activegate-vnet-nonprod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "dynatrace-activegate-vnet-nonprod"
      + private_dns_zone_name = "demo.apps.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/dynatrace-activegate-nonprod/providers/Microsoft.Network/virtualNetworks/dynatrace-activegate-vnet-nonprod"
    }

  # module.demo-apps-private-dns.azurerm_private_dns_zone_virtual_network_link.vnet_link["private-dns-resolver-uksouth-vnet-nonprodi"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "private-dns-resolver-uksouth-vnet-nonprodi"
      + private_dns_zone_name = "demo.apps.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/private-dns-resolver-uksouth-nonprodi/providers/Microsoft.Network/virtualNetworks/private-dns-resolver-uksouth-vnet-nonprodi"
    }

  # module.demo-apps-private-dns.azurerm_private_dns_zone_virtual_network_link.vnet_link["vpn"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "vpn"
      + private_dns_zone_name = "demo.apps.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/mgmt-vpn-2-mgmt/providers/Microsoft.Network/virtualNetworks/mgmt-vpn-2-vnet"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":847,"Program":"tfcmt","SHA1":"","Target":"demo - TerraformPlanApply","Vars":{}} -->